Revit 2026 API

# DisplacementElementIsAllowedAsDisplacedElement Method

---

Indicates if the specified element is allowed to be displaced.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsAllowedAsDisplacedElement(
	Element element
)
```
```vb
Public Shared Function IsAllowedAsDisplacedElement (
	element As Element
) As Boolean
```
```cpp
public:
static bool IsAllowedAsDisplacedElement(
	Element^ element
)
```
```fsharp
static member IsAllowedAsDisplacedElement :
        element : Element -> bool
```

#### Parameters

element Element
     Any element.

#### Return Value

Boolean Returns true if the element is eligible to be assigned to a DisplacementElement.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Exclusions include view specific elements as well as certain categories of elements.

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace